app/controllers/users_controller.rb

SELECT * FROM "users" WHERE (lower(name) LIKE 'to%') ORDER BY name ASC
---
  def auto_complete_name
    users = User.all(:conditions => [
      'lower(name) LIKE ?', "#{params[:q].downcase}%"
    ], :order => 'name ASC')